{
  "members": [
    {
      "firstName": "Abbie",
      "lastName": "Roads",
      "id": 1,
      "blurb": "Abbie Roads is a 2014 Golden Heart® Finalist. She is represented by Michelle Grajkowski of 3 Seas Literary. Abbie writes darkly emotional novels and always gives her damaged characters a happy ending. During the day, she's a mental health counselor known as much for her blunt honest style of therapy as for the shoes she wears. She believes that many of life's problems can be solved with a kick-ass pair of heels and a chocolate martini—or three. If that doesn't work—seek professional help.",
      "facebook": "http://www.facebook.com/abbieroads2",
      "website": "http://www.abbieroads.com",
      "image": "Roads.jpg"
    },
    {
      "firstName": "Alicia",
      "lastName": "Anthony",
      "id": 2,
      "image": "Anthony.jpg",
      "blurb": "Raised in the small town of London, Ohio, I now work as an elementary school literacy specialist for my alma mater. After a brief stint as a theatre major at the University of Southern California, I returned home to Ohio to complete a B.A. in Communications from The Ohio State University and later a Master of Education in Literacy. Teacher by day, writer by night, I am pursuing my dream career as an author of suspense. Inner struggle and family dynamics are inherently interwoven in my work. I am a member of Romance Writers of America (Central Ohio Fiction Writers, Kiss of Death, and Celtic Hearts chapters), International Thriller Writers, Sisters in Crime (SiC Columbus Ohio chapter), and Mystery Writers of America, as well as other local cooperatives. I live in Jeffersonville, Ohio with my husband, Doug, and daughter, Jillian. In my free time I can be found at the local movie theatre, curled up on the sofa with a good book, or in the barn taking care of the family's two horses, nine chickens, six cats, two dogs, and three rabbits (not to mention a hedgehog). I am currently at work on my second novel as I pursue publication. Accomplishments: Third place in the 2014 Golden Claddagh Contest",
      "website": "http://www.alicia-anthony.com"
    },
    {
      "firstName": "Barbara",
      "lastName": "Lohr",
      "id": 3,
      "facebook": "http://www.facebook.com/BarbaraLohrAuthor",
      "email": "blohr2014@gmail.com",
      "twitter": "http://www.twitter.com/BarbaraJLohr",
      "website": "http://www.BarbaraLohrAuthor.com",
      "image": "Lohr.jpg",
      "blurb": "Barbara Lohr writes heartwarming romance with a flair for fun and subtly sexy love scenes. In her novels, feisty women take on hunky heroes and life's issues. Family often figures in her stories. “No woman falls in love without some family influence, either positive or negative.” Her series include Windy City Romance and Man from Yesterday. Dark chocolate is her favorite food group, and she makes a mean popover. When she's not writing, she loves to bike, kayak or golf. Formerly an Ohio resident, Barbara now lives mainly in the South of the USA with her husband and a cat that insists he was Heathcliff in a former life. For more information on the author and her work, please see her website or Facebook.",
      "novels": [
      "Windy City Romance - Series",
      "Finding Southern Comfort",
      "Her Favorite Mistake",
      "Her Favorite Honeymoon",
      "Her Favorite Hot Doc",
      "Rescuing the Reluctant Groom",
      "The Southern Comfort Christmas",
      "Man from Yesterday - Series",
      "Coming Home to You",
      "Always on His Mind",
      "In His Eyes"
      ],
      "novellas": [
        "The Firefly Summer",
        "Salty Carmel Christmas",
        "Summer Riptide",
        "The Christmas Baby Bundle"
      ]
    },
    {
      "firstName": "Becky",
      "lastName": "Barker",
      "id": 4,
      "image": "Barker.jpg",
      "website": "http://www.beckybarker.com",
      "twitter": "http://www.twitter.com/BeckyBarker",
      "facebook": "http://www.facebook.com/BeckyBarker",
      "email": "write@beckybarker.com",
      "blurb": "Becky Barker is a multi-published author whose romance novels have been translated into more than a dozen foreign languages, into electronic format, and have been reissued in trade paperback as well as large print, hardcover library editions. Her personal hero is a former Marine who helped her create three wonderful children. These days, Rachel and her husband, Jerramy; Amanda and her husband, Jay; and Thad and his wife, Dara, all live within a few miles of Mom and Dad in rural Ohio. Besides spending time with her family, Becky enjoys music, gardening and reading. She loves to hear from readers and can be reached through her website at BeckyBarker.com",
      "novels": [
        "CHEY'S COWBOY, Indie published, 2013",
        "STOWAWAY, Samhain Publishing 2011",
        "BRIDLETON, Cerridwen Press",
        "TERMS OF SURRENDER, Samhain Novella",
        "CADE'S CHALLENGE, Samhain Publishing",
        "HANCHART LAND, Cerridwen Press",
        "A MATTER OF TRUST, Cerridwen Press",
        "ON WINGS OF LOVE, Samhain Publishing",
        "CHAMELEONS, Cerridwen Press",
        "UNDERCOVER VIRGIN, Silhouette Intimate Moments",
        "LOVE IN THE AIR, Prescott Pilot Anthology, Wildside Press",
        "THE COWBOY AND THE CRADLE",
        "DANGEROUS",
        "WESTERN DREAMS",
        "TO TRUST AGAIN",
        "LOVING CARLIE, Prescott Pilot, Novella #3",
        "LOGAN'S LADY, Prescott Pilot, Book #2",
        "BORN TO FLY, Prescott Pilot, Book #1",
        "THE LAST REAL COWBOY, Silhouette Intimate Moments",
        "BEDROOM EYES, Kismet",
        "IMPOSSIBLE MATCH, Kismet",
        "SASSY LADY, Kismet",
        "BACK IN HIS ARMS, Kismet",
        "RENEGADE TEXAN, Kismet",
        "CAPTURED BY A COWBOY, 1987, Dell Candlelight Supreme"
      ]
    },
    {
      "firstName": "Bree",
      "lastName": "Roberts",
      "id": 5,
      "website": "http://www.breeroberts.com",
      "blurb": "Writer Bree Roberts worked as a programmer before deciding to end her career and become a stay-at-home mom.  This gave her plenty of time to pursue a career in fiction writing. Bree is a native of Kingsport, Tennessee.  Growing up, she was a voracious reader of anything she could get her hands on, including her friend Cindi's Nancy Drew books, her father's Greek mythology books, sports books, Agatha Christie books from her weekly library trips, and by the age of eight had read the KJV Bible cover-to-cover.  As she got older, she gravitated more toward mystery fiction. Any book at the public library that had a skull and crossbones symbol on its spine inevitably found its way home with Bree. And then she discovered Stephen King. It was love. Or maybe it was just indigestion. Fully intending to write Mystery, perhaps even Horror, Bree was steered toward Romance Writers of America by a high-school friend, and Bree fell in love with Contemporary Romance. Stephen King was kicked to the curb (sorry Stephen!). Bree is a member of Romance Writers of America and Central Ohio Fiction Writers, and is currently living her own Happily Ever After in Ohio with her husband, their two toddlers, and a Black Labrador, Jasmine.",
      "image": "Roberts.jpg"
    },{
      "firstName": "Denise",
      "lastName": "Gwen",
      "id": 16,
      "facebook": "https://www.facebook.com/denise.barone.50",
      "twitter": "https://twitter.com/BaroneLiterary",
      "website": "http://www.denisegwen.com/",
      "image": "Gwen.jpg",
      "blurb": "One night, when Denise Gwen was thirteen years old, her mother kept her up half the night, in order to edify her and make her aware of the many charms and talents of Jane Austen. Her mother then proceeded to act out key scenes from a copy of Emma, which her mother then presented to her as a gift. Denise read Emma and didn't really 'get' Jane Austen. Not right away, in any event. It wasn't until she read Pride and Prejudice, that Denise finally 'got' Jane Austen, and instantly became a convert and worshipful admirer of all things Austen. Denise hopes that one day her writing will reach the same sublime level as a Jane Austen novel; all she can do in the meantime, however, is continue to work at her craft. Denise Gwen lives in Cincinnati with her husband and two cats, one of whom is an excellent mouser, the other one, not so much. The cat, you know.",
      "novels": [
        "Trailer Park Wives - The Singlewide Edition, at Amazon.com and Smashwords.com",
        "Trailer Park Wives - The Doublewide Edition, Bigger, better, wider, at Amazon.com and Smashwords.com",
        "Molly's Folly, from CleanReads.com",
        "Judging Rachel, from Soul Mate Publishing",
        "Perfect Girls, a sweet YA romance, from Sweet Cravings Publishing",
        "House of Wax, available at Amazon.com"
      ]
    },
    {
      "firstName": "Donna",
      "lastName": "MacMeans",
      "id": 6,
      "email": "DMacMeans@aol.com",
      "website": "http://www.donnamacmeans.com",
      "blurb": "Award winning author Donna MacMeans writes about the humor in relationships in her seductively witty romance page-turners. Her books have won the Romance Writers of America® Golden Heart, Romantic Times’s Reviewer Choice Award for Historical Love & Laughter, and numerous regional and local awards. Best known for her historical romances set in the late 1800s, she also writes time-travel and paranormal romance. She received the PRO-mentor of the year award from Romance Writers of America (RWA) in 2014 for her work with unpublished authors and the RWA Service Award in 2013 for her work with chapter treasurers. A licensed CPA, she is the current treasurer of Romance Writers of America while she maintains a small practice in Westerville, Ohio. She lives her own happily-ever-after with her husband of many, many years. Learn more about Donna through her website www.DonnaMacMeans.com where you can register for her monthly newsletter that includes news, first peeks and frequent free giveaways.",
      "image": "MacMeans.jpg",
      "novels": [
        "DREAM QUEST (anthology), LTD Books, 2003",
        "IN A HEARTBEAT (writing as Donna Richards) Samhain Publishing, Spring 2007",
        "THE EDUCATION OF MRS. BRIMLEY, Berkley, Nov. 2007",
        "THE TROUBLE WITH MOONLIGHT, Berkley, June 2008",
        "TAILS OF LOVE (anthology), Berkley, June 2009",
        "SEDUCTION OF THE DUKE, Berkley Sensation, April 2009",
        "REDEEMING THE ROGUE, Berkley, August 2011",
        "THE CASANOVA CODE, Berkley Sensation, June 2012",
        "BOUND BY MOONLIGHT, self-published (reissue of THE TROUBLE WITH MOONLIGHT), April 2013",
        "THE WHISKY LAIRD’S BED, Berkley Intermix, July 2014",
        "CHARMING THE PROFESSOR, self-published, December 2015",
        "WELCOME TO HAVEN HARBOR (anthology), October 2016",
        "IN A HEARTBEAT (reissue), self-published, July 2016"
      ]
    },
    {
      "firstName": "Elysa",
      "lastName": "Hendricks",
      "id": 7,
      "image": "Hendricks.jpg",
      "blurb": "After trying her hand at a variety of careers, insurance underwriter, video store owner, home day care and cleaning houses, Elysa Hendricks, a longtime reader sat down to write a short contemporary novel. When her heroine turned out to be a winged, telepathic alien, Elysa decided she enjoyed writing stories set in different places and times. While living in north east Illinois she helped found the Windy City Chapter and the Futuristic, Fantasy & Paranormal Chapters of Romance Writers of America and taught workshops on writing at writer's conferences and at local community colleges. Recently relocated to central Ohio she's happy to be part of the COFW family. Someday she dreams of writing on a laptop while sitting on a tropical beach. In the meantime she keeps warms during Ohio's chilling winters by creating sizzling love scenes.",
      "email": "elysa@elysahendricks.com",
      "website": "http://www.elysahendricks.com",
      "novels": [
        "THE BABY RACE Smashwords 2011",
        "RAWHIDE SURRENDER Hard Shell Word Factory",
        "GEMINI MOON ImaJinn Books",
        "CRYSTAL MOON ImaJinn Books",
        "SHADOW MOON ImaJinn Books",
        "FORBIDDEN MOON ImaJinn 2009",
        "STAR CRASH Dorchester 2007",
        "THE SWORD AND THE PEN Dorchester 2009",
        "STAR RAIDERS Coming from Dorchester, March 2010"
      ]
    },
    {
      "firstName": "IreAnne",
      "lastName": "Chambers",
      "id": 8,
      "blurb": "IreAnne Chambers' books contain the spirit and tone of the traditional regency with the promise of mystery, adventure and mishap intermixed to create a happy ever after with plenty of fun and surprises along the way. When creating her pen name, she looked to her Scottish and Irish heritage and discovered the name Eireann.  Eire means Ireland in Gaelic and the name Erin is a variant in both English and Irish.  IreAnne was born after a quick search of the internet yielded zero hits, confirming the name's uniqueness. In high school, IreAnne enjoyed writing poetry and song lyrics.  But, her love for the traditional regency romances of Jane Austen, filled with dashing heroes and feisty heroines, spurred her desire to write in the genre.  As Novelist and Nobel Prize Winner Toni Morrison said, “If there's a book you really want to read, but it hasn't been written yet, then you must write it.”  IreAnne does just that.",
      "website": "http://www.IreAnneChambers.com",
      "facebook": "https://www.facebook.com/AuthorIreAnneChambers",
      "twitter": "https://twitter.com/IreAnne",
      "googlePlus": "https://plus.google.com/u/0/108643846401187304464/posts",
      "novels": [
        "An Adventure in Guernsey – 2015",
        "Storm Chasers of Wentworth Hall – 2016"
      ],
      "image": "chambers.jpg"
    },
    {
      "firstName": "J. Paulette",
      "lastName": "Forshey",
      "id": 9,
      "email": "lvkkincaid7@yahoo.com",
      "image": "Forshey.jpg",
      "blurb":"J. Paulette Forshey is an award-winning author who lives in a small Ohio town with her husband, a Basset Hound and a tiny Papillion who both believe they are princesses in disguise. Paulette's mornings belong to her writing, her days are spent loving her five grandbabies, and her nights belong to her husband, the inspiration for her heroes. Paulette has a naughty side and pens those stories under the name of Genevieve Delacroix.",
      "facebook": "http://www.facebook.com/paulette.forshey",
      "twitter": "https://twitter.com/ForsheyJ",
      "website": "http://www.jpauletteforshey.com",
      "novels": [
        "The Tarczal Alliance",
        "The Estate",
        "Chances Taken",
        "A Tango Trinity",
        "33 Days Til Christmas",
        "Cat and the Wizard",
        "Three to Tango",
        "Passionate Cooks"
      ],
      "novellas": [
        "The Welcome Mat",
        "The Billiards Game",
        "Millie and the Vampire",
        "The Tarczal Connection",
        "Job Security"
      ]
    },
    {
      "firstName": "Janie",
      "lastName": "Mason",
      "id": 10,
      "email": "djconner@earthlink.net",
      "website": "http://www.janiemason.com",
      "facebook": "https://www.facebook.com/janie.mason.127",
      "image": "Mason.jpg",
      "blurb": "Janie is a Columbus, Ohio native and is married to her own romance hero. David. She has two adult children and one loveable mutt. From Disney's Cinderella to Susan Elizabeth Phillips football players and Suzanne Brockmann's Navy Seals, Janie has always been a huge fan of Happily Ever Afters. She's even dedicated a page of her web site to real life HEAs. Her romances feature heroines you want to root for, heroes you'd like to know better and a Happily Ever After that makes you glad you were part of it all.",
      "novels": [
        "SERVICING RAFFERTY, Book 1 of The Greenville Girls from Samhain Publishing",
        "REDHEAD BLITZ, Book 2 of The Greenville Girls",
        "WORTH THE WAIT, Book 3 of The Greenville Girls",
        "MODEL BEHAVIOR, from Samhain Publishing",
        "RISKING LOVE, Book 1 of the New Beginnings Trilogy",
        "TRUSTING LOVE, Book 2 of the New Beginnings Trilogy"
      ],
      "novellas": [
        "THE SECRET RIDDLES OF ADELINE SMITH, a historical short story"
      ]

    },
    {
      "firstName": "Julia",
      "lastName": "Blaine",
      "id": 11,
      "website": "http://www.amazon.com/Julia-Blaine/e/B00Q0R2GHW",
      "image": "Blaine.jpg",
      "blurb": "Julia Blaine lives on a rural country road in a home surrounded with trees, two cats, one dog and the neighbor's animals that come over to play. The cats don't always want to play but one grumpy husband keeps letting them outside. Ohio is beautiful but Julia finds her mind wandering to Regency England, vampires, ghosts and even to peculiar occurrences in the modern world. What if two men awakened in each others' bodies after a terrible auto accident? What if they both loved the same woman and one was married to her? That's just one plot among her many pre-published novels and novellas. Look on Amazon. “Shot through the Heart,” is a traditional Regency available on Kindle. Beautiful women and dashing heroes negotiate the pitfalls of the Season. Is the duel in Hyde Park just an excuse for murder? Meddling aunts and annoying animals are not totally helpful in solving the mystery. Watch for more postings on Amazon in the near future."
    },
    {
      "firstName": "Karen",
      "lastName": "Harper",
      "id": 12,
      "email": "Karen.Harper.Author@gmail.com",
      "website": "http://www.KarenHarperAuthor.com",
      "facebook": "http://www.facebook.com/KarenHarperAuthor",
      "image": "Harper.jpg",
      "blurb": "Karen Harper is the New York Times and USA TODAY bestselling author of romantic suspense and historical novels.  A lifelong Ohioan, Karen and her husband make their home in Columbus.  Formerly an Ohio State English instructor and high school teacher, Karen has written full time since 1990 with 70 novels in print.  She is the winner of the Mary Higgins Clark Award for her novel DARK ANGEL, set in Ohio Amish country.  Karen's British historicals focusing on the lives of real Tudor and Edwardian women have been bestsellers in England and Russia.  Her novels have been translated into many foreign languages and are available as ebooks and in large print and audio.  Her publishers are Mira Books and HarperCollins. Her most recent contemporary books are THE COLD CREEK TRILOGY: SHATTERED SECRETS, FORBIDDEN GROUND and BROKEN BONDS set in Appalachian Ohio.  Coming soon, THE SOUTH SHORE TRILOGY.  Her most recent historical novels are MISTRESS OF MOURNING and coming soon THE ROYAL NANNY."
    },
    {
      "firstName": "Karin",
      "lastName": "Shah",
      "id": 13,
      "website": "http://www.KarinShah.com",
      "image": "Shah.jpg",
      "blurb": "From childhood, Karin Shah wrote herself into her favorite TV shows before falling asleep every night. But, despite graduating with a degree in English as a Writing Art from SUNY Oswego, Karin had no plans to write as a career. She got her Master's in Library and Information Science at the State University at Buffalo and worked as a School Librarian in a suburb of Rochester, NY, for five years, before discovering writing was where her heart lay. Karin lives with her amazing husband Nikhil, brilliant children Natalie and Roman, a mischievous basenji, and an exuberant vizsla, in Westerville, Ohio. She belongs to RWA, Central Ohio Fiction Writers, the Futuristic, Fantasy and Paranormal special interest chapter of the RWA, and the Society of Children's Book Writers and Illustrators."
    },
    {
      "firstName": "Lily",
      "lastName": "Vega",
      "id": 14,
      "image": "Vega.jpg",
      "website": "http://www.lilyvega.com/",
      "blurb": "Lily Vega lives in the Midwest with her sexy husband who combines all of Dean Winchester's best qualities with a flair for computers. She continually cultivates her dirty mind, fueling it with caffeine and craft beer. She believes all creatures, especially those of the night, deserve mind-blowing sex with a happily ever after.",
      "facebook": "http://www.facebook.com/LilyVegaWriter",
      "twitter": "https://twitter.com/LV_Writer"
    },
    {
      "firstName": "Lita",
      "lastName": "Lawson",
      "id": 15,
      "image": "Lawson.jpg",
      "blurb": "Lita fell in love with romance and alpha males when her mother took her to see Gone With the Wind.  An avid reader since she was young, her passion for love stories evolved when she decided to try her hand at writing one. Lita writes traditional romance with sexy heroes you will fall in love with. She hopes you enjoy her stories, from the first kiss to the happily ever after.  Lita is a member of Romance Writers of America® and lives in Ohio with her husband and two cats.",
      "facebook": "https://www.facebook.com/authorlitalawson",
      "website": "http://www.allromancenovels.com"
    },
    {
      "firstName": "Marcia",
      "lastName": "James",
      "id": 17,
      "blurb": "Marcia James finaled in eleven Romance Writers of America contests before selling her first contemporary romance. Her releases include Sex & the Single Therapist (the first in a comic romantic mystery series) and the \"Klein's K-9s Service Dogs\" contemporary romance series. She is a national and international ebook bestseller, who writes hot, humorous romances featuring heroines you can root for, heroes to die for, and funny dogs. In her eclectic career, Marcia has shot submarine training videos, organized celebrity-filled nonprofit events and had her wedding covered by People Magazine. After years of dealing with such sexy topics as how to safely install traffic lights, she is enjoying “researching” and plotting her novels' steamy love scenes with her husband and hero of many years.",
      "website": "http://www.MarciaJames.net",
      "facebook": "http://www.facebook.com/MarciaJamesAuthor",
      "twitter": "http://twitter.com/Marcia_James",
      "pinterest":"http://pinterest.com/marciajames/",
      "image": "James.jpg",
      "novels": [
        "At Her Command",
        "Sex and the Single Therapist",
        "Tails of Love anthology",
        "Romancing Christmas 1 box set",
        "Romancing Christmas 2 box set",
        "Spring Into Love box set",
        "Score One for Love box set",
        "Spicy Christmas Kisses 1 box set",
        "Spicy Christmas Kisses 2 box set",
        "Love Notes box set",
        "First Glance box set",
        "Sneak Peek Samplers: Contemporary Romance",
        "Passionate Cooks: Recipes from Today's Hottest Romance Authors",
        "The Write Ingredients cookbook"
      ],
      "novellas": [
        "Heating Up the Holidays",
        "Love Unleashed",
        "Racing Hearts: Klein's K-9s Book 1",
        "8 Hounds a-Howling: Klein's K-9s Book 2",
        "Nothing But a Hound Dog: Klein's K-9s Book 3",
        "Scrooge & the Secret Santa: Klein's K-9s Book 4"
      ]
    },
    {
      "firstName": "Marisa",
      "lastName": "Dillon",
      "id": 18,
      "website": "http://www.marisadillon.com",
      "image": "Dillon.jpg",
      "blurb": "With a degree in journalism, Marisa has spent many years writing for the television industry. As an award-winning producer/director/marketer, she has worked on commercial production, show creation, product branding and social media. Marisa's passion for writing began when her first-grade teacher read her poem aloud and posted it on the classroom wall. She soon followed up by writing plays for her neighborhood friends and hosting the productions in her garage. Marisa has always enjoyed reading romance novels and now realizes a dream come true, writing romantic adventures, not for the faint of heart. Her debut novel, from Soul Mate Publishing, The Lady of the Garter, is available on Amazon. She lives in Kettering, Ohio, with her first love and knight in shining armor, James.",
      "facebook": "https://www.facebook.com/marisadillonauthor/",
      "twitter": "http://twitter.com/marisadillon",
      "novels": [
        "The Lady of the Garter"
      ]
    },
    {
      "firstName": "Nancy L.",
      "lastName": "White",
      "email": "nancywhite0529@gmail.com",
      "website": "http://www.nancylwhiteauthor.com/",
      "id": 21,
      "blurb": "Nancy White is a freelance writer and a graduate of Capital University in Columbus, Ohio with a B.A. in English/Professional Writing.  She is a member of the Scribophile Critique Group online.  Her craft memberships include Romance Writers of America (PRO member), Central Ohio Fiction Writers, and The Writer's Center.  Nancy's first publication, Children Should be Seen, Not Heard, was published in the Only Trollops Shave Above the Knee anthology from Blue Lobster Book Co.  Mother's Day 2015.   Currently, she is working on her first novel.",
      "image": "White.jpg"
    },
    {
      "firstName": "Sandy",
      "lastName": "Loyd",
      "id": 24,
      "blurb": "Born and raised in Utah, Sandy Loyd, a Western girl through and through, now resides in Louisville, Kentucky. As much as she loves her current hometown, she misses the mountains and has to go back to her roots to get her mountain and skiing fix at least once a year. Otherwise her muse suffers. As a former sales rep for a major manufacturer, she's traveled extensively, so she has a million stored memories to draw from for her stories. She spent her single years in San Francisco and considers that city one of America's treasures, comparable to no other city in the world. Her California Series, starting out with Winter Interlude, are all set in the Bay Area. Sandy is now an empty nester and writes full time. With almost two dozen books published in several genres including contemporary romance, romantic suspense, time travel romance and historical romance, she strives to come up with fun characters—people you would love to call friends. And we all know friends have their baggage and when we discover what makes them tick, we come to love them even more. She doesn't skimp on the romance. And because she loves puzzles, she doesn't skimp on intrigue, either. Yet whether romantic suspense, contemporary romance, or historical romance, she always tries to weave a warm love story into her work, while providing enough twists and turns to entertain any reader.",
      "website": "http://sandyloyd.com/",
      "image": "Sandy-Loyd.jpg"
    },
    {
      "firstName": "Sandy",
      "lastName": "Wickersham-McWhorter",
      "id": 25,
      "image": "Wickersham.jpg",
      "website": "http://www.sandywick.com/",
      "blurb": "A native of Muncie, Indiana, Sandy has lived in north-central Ohio since 1973.  She's been an LPN since 1980. She has her husband of 34 years, two sons, a daughter-in-law, two granddaughters, two dogs, and an odd number of goldfish in her outdoor pond all living with her in an 1890s home that was a general store\\post office. Fortunately, only her dog has commandeered her writer's cave so far. Sandy began writing in third grade when she turned her dreams and nightmares into short stories (she still has that notebook). Science fiction classics and comic books were her reading mainstay; as an adult, she added historical fiction then romances in the '80s. The adult writing bug bit in 1990 after a comment by her oldest son. When she realized she needed cheap nursing CEUs and the degree most writers seem to have, Ohio State University beckoned. While earning an English degree, she wrote for three newspapers and was a feature writer for Choice, a Christian magazine. Now she writes romance, science fiction, inspirational, women's fiction, and a mix of them all, and substitutes in local schools, teaches college English 101 in local prisons, gardens, and does many types of artwork.",
      "novels": [
        "The Diamond Road – 2012 Cottonwood Place-Inspirational Romance from White Rose Publishing",
        "The Winds of Fall from The Wild Rose Press"
      ]
    },
    {
      "firstName": "Saralee",
      "lastName": "Etter",
      "id": 26,
      "image": "Etter.jpg",
      "website": "http://www.saraleeetter.com/",
      "blurb": "A stay-at-home mom by day and romance writer by night, Saralee has been a member of the Central Ohio Fiction Writers and the Romance Writers of America since 2003. A LIMITED ENGAGEMENT (Cerridwin Press August 2007) was the second of three manuscripts that she wrote before making the leap to published author. Saralee retired from the practice of law in 1996, when she moved to Ohio. She has been involved in public relations consulting, local newspaper reporting, and working as a legislative lobbyist. She lives in Pataskala, Ohio with her husband, her son, and her cranky old black cat.",
      "novels": [
        "A LIMITED ENGAGEMENT, Cerridwen Press' Cotillion imprint. (August 2, 2007)"
      ]
    },
    {
      "firstName": "Serena",
      "lastName": "Gilley",
      "id": 27,
      "image": "Gilley.jpg",
      "website": "http://www.serenagilley.com/",
      "blurb": "Serena Gilley spent her early years reading fantasy and fairy tales, and believing there was a distinct possibility that both of them were real. When she embarked on a career writing romance, she realized her suspicions were true. The most magical force in the universe is Love. Today she lives out her own happily-ever-after with a handsome prince in a beautiful castle, taming unicorns and granting sparkly wishes every day. Okay, so the prince is a regular guy, the unicorns are really just teenagers, and the wishes are no more spectacular than frozen pizza on Friday night, but it's a fantasy world just the same. She's an award-winning, multi-published author and would love to have you visit her world. You might find yourself devoured by dragons… and liking it!",
      "novels": [
        "LICKED BY THE FLAME, February 2015, Grand Central Forever Yours",
        "BY THE MAGIC OF STARLIGHT, October 2014, Grand Central Forever Yours",
        "KISSED BY THE WAVE, August 2014, Grand Central Forever Yours"
      ]
    },
    {
      "firstName": "Stacy",
      "lastName": "McKitrick",
      "id": 28,
      "website": "http://www.stacymckitrick.com/",
      "blurb": "Stacy McKitrick fell in love with paranormal romance, decided to write her own and found her passion in life. She used to work in accounting, now she spends her time with vampires, ghosts, and aliens. Born in California, she currently resides inOhio with her husband. They have two grown children. You can find her at website www.stacymckitrick.com or her blog www.stacysrantings.blogspot.com.",
      "image": "McKitrick.jpg",
      "novels": [
        "My Sunny Vampire",
        "Bite Me, I'm Yours (Books 1 & 2 of the Bitten by Love series)",
        "Ghostly Liaison (Book 1 of the Ghostly Encounter series)"
      ]
    },
    {
      "firstName": "Susan Gee",
      "lastName": "Heino",
      "id": 29,
      "image": "Heino.jpg",
      "blurb": "Award-winning, bestselling author Susan Gee Heino writes lighthearted Regency Romances full of quirky heroines, wicked banter, and dashing cravat-wearing heroes. Adventures ensue, hilarity happens, but the hero always ends up with his lady. And vice versa. Ms. Heino began her writing career in the theatre. She worked for several years in various small theatre and repertory groups where she did everything from writing, casting, and directing to acting, singing, and mopping floors. Somehow along the way she ended up married to a Lutheran pastor and turned her love of history, humor and happy endings toward writing romance. In 2008 she won RWA's Golden Heart Award for Best Regency Historical and signed her first multi-book deal after going to auction. She has gone on to hit best-sellers lists and branch out into other Romance sub-genres, but her first love will always be the Regency time period. She is a member of RWA's Beaumonde Regency specialty chapter as well as a member of the Jane Austen Society of North America. Ms. Heino is an author, workshop presenter, and preacher's wife who lives in rural Ohio with her non-cravat-inclined husband, two very remarkable children, and an accidental collection of critters. She loves to hear from readers so please visit her website or connect on social media.",
      "website": "http://www.susangh.com/",
      "novels": [
        "THE EARL'S PASSIONATE PLOT, April 2014",
        "THE EARL'S INTIMATE ERROR, February 2014, Amazon Story Front",
        "THE EARL'S CHRISTMAS DELIVERY, December 2013",
        "MISS FARROW'S FEATHERS, November 2013",
        "YULETIDE LIES, December 2012",
        "MISS WHEATON'S WHISKERS, September 2012",
        "PASSION AND PRETENSE, March 2012, Berkley Sensation",
        "TEMPTRESS IN TRAINING, August 2011, Berkley Sensation",
        "DAMSEL IN DISGUISE, Summer 2010, Berkley Sensation",
        "MISTRESS BY MISTAKE, December 2009, Berkley Sensation"
      ]
    },
    {
      "firstName": "Suzanne M.",
      "lastName": "Sabol",
      "id": 30,
      "image": "Sabol.jpg",
      "website": "http://www.suzannemsabol.com",
      "email": "suzanne.m.sabol@gmail.com",
      "twitter": "https://twitter.com/SuzanneMSabol",
      "blurb": "Suzanne M. Sabol is the author of Urban Fantasy and Paranormal Romance. She has been writing from the age of 16 when she finished her first full length novel. Suzanne M. Sabol graduated from The Ohio State University, majoring in Criminology, International Studies, Russian and Political Science. She continued to write and published her first book Cursed in March of 2009. She currently lives in Columbus Ohio with her husband and works as a Human Resources Professional and Fiscal Officer. She is a member of Central Ohio Fiction Writers and Romance Writers of America.",
      "novels": [
        "SLIVER OF SILVER, 2013, Soul Mate Publishing",
        "THE GOLDEN ANIDAE, 2013, Soul Mate Publishing",
        "MIDNIGHT ASH, November 2012, Soul Mate Publishing",
        "POOL OF CRIMSON, April 2012, Soul Mate Publishing",
        "CURSED, March 2009, Strategic Book Publishing"
      ]
    },
    {
      "firstName": "Jenna",
      "lastName": "Grinstead",
      "id": 31,
      "image": "Grinstead.jpg",
      "website": "http://jennagrinstead.com",
      "email": "jennagrinstead@gmail.com",
      "facebook": "http://www.facebook.com/jennagrinstead",
      "twitter": "https://twitter.com/storiestobe",
      "blurb": "Jenna Grinstead lives with her husband and four children in Columbus Ohio. When she's not plotting her next novel you can find her eating mint chocolate chip ice cream. Sadly, she's addicted to young adult fiction and dark chocolate and refuses to seek help. Visit www.jennagrinstead.com for more information.",
      "novellas": [
        "YOU AIN'T NO 5'10\", Summer's Double Edge Anthology, 2013, Elephant's Book Shelf Press"
      ]
    },
    {
      "firstName": "Jeanne",
      "lastName": "Estridge",
      "id": 32,
      "image": "estridge.jpg",
      "website": "http://jeanneestridge.com",
      "email": "jeanne.estridge.author@gmail.com",
      "facebook": "https://www.facebook.com/jeanne.estridge",
      "pinterest": "https://www.pinterest.com/jeanneestridge/",
      "googlePlus": "https://plus.google.com/101232735794680864652",
      "twitter": "https://twitter.com/JeanneEstridge",
      "blurb": "Jeanne Oates Estridge wrote her first short story in third grade, a tale of birth-control-challenged bunnies who named their children in alphabetical order—Alice, Benjamin, Cathy, Dexter—all the way down to baby Zachary. Later that year, when given an assignment to depict what she wanted to be when she grew up, Jeanne drew herself in a floor-length, crayon-blue dress, sitting at a typewriter.<br><br>Life has a way of handing us detours, through, and Jeanne wound up earning her degree, and her living, as computer analyst. She continued to write at night and on weekends, but she could never quite manage to write anything that satisfied her (or any of the agents and editors she submitted to).<br><br>But she didn't give up. Fifty all-too-short years after she penned that first story, she returned to college to earn a Master's Certificate in Creative Writing at the Nora Roberts' School of Romance Writing at McDaniel College. Working under the mentorship of NYT Bestseller and former high school English teacher Jenny Crusie, Jeanne wrote a paranormal romance, <em>Demons Don't</em>, which went on to win the 2015 RWA® Golden Heart®.<br><br>The first book of Jeanne's <em>Touched by a Demon</em> trilogy of paranormal romances will release in September, 2018.",
      "novellas": [
        "Kim in Satin"
      ],
      "novels": [
        "<em>The Demon Always Wins</em> -- coming in September, 2018",
        "<em>The Demon's in the Details</em> -- coming in October, 2018",
        "<em>The Demon Wore Stilettos</em> -- coming in November, 2018"
      ]
    }
  ]
}