{
  "posts": [
    {
      "id": 1,
      "createdOn" : "2015-12-29T00:00:00",
      "image" : "",
      "title" : "January Meeting – New Location!",
      "postTags" : [1, 2],
      "createdBy" : "Rachel",
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Donna MacMeans</strong><br>Donna is a multi-published author and Certified Public Accountant.<br>DATE:  Jan. 16, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION: We will be meeting at this new location for the first several months of 2016<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br>TOPIC: With the holidays behind us, it's time to turn our attention to taxes. Let Donna answer your pressing tax questions as it relates to writing – you're sure to learn things you didn't know!<ul><li>Is your writing a business or a hobby?  Nine questions you need to answer to know if your writing is a business.</li><li>How to maximize your deductions to reduce income</li><li>As an indie or traditional author, what forms must YOU send to the IRS to report certain transactions?</li><li>Now that you've published, what forms can you expect to receive to assist you in preparing your return?</li><li>Self-employment tax, do you owe it? How is it calculated?</li><li>Suggestions on making your bookkeeping easier for 2016.</li></ul></p>"
    },
    {
      "id" : 2,
      "createdOn" : "2015-12-29T00:00:00",
      "image" : "",
      "title" : "February Meeting",
      "createdBy" : "Rachel",
      "postTags" : [1, 2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Gigi Morgan</strong><br>DATE:  Feb. 13, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br>TOPIC: <strong>Introduction to Scrivener 2</strong><br><br> Meet the one piece of software that will change how you write forever. Plotter, pantser, and everyone in-between can benefit from the innovative features of Literature and Latte's Scrivener 2. From keeping you more organized, never letting you lose another draft, or creating an e-book, Scrivener is the toolbox every writer needs. Get your feet wet before the presentation by downloading the free trial version today. Available for both Apple and Windows computers, the free trial version contains full functionality and 30 days of use.</p>"
    },
    {
      "id" : 3,
      "createdOn" : "2016-02-10T00:00:00",
      "image" : "",
      "title" : "Contest Coming Soon!",
      "createdBy" : "Rachel",
      "postTags" : [4],
      "type": "Contest",
      "content" : "<p>The annual Ignite the Flame Contest is gearing up for 2016! Judges have been assigned and categories have been announced!<br></p><div class='col-md-6 col-sm-12 text-center'><a class='btn btn-primary' href='/contest'>Contest Page</a><br><br><p class='text-left'>Click the link above to view the contest page. Any updates and forms will appear here. Check back for updates, as we will make any contest related announcements here.</p></div><div class='col-md-6 col-sm-12 text-center'><a class='btn btn-primary' href='http://cofwevents.org/docs/ITF_Contest_Rules_2016.pdf' target='_blank'> Contest Rules </a><br><br><p class='text-left'>You can also check out the rules and scoring information by visiting the above link. We've provided a printable pdf of information you will need to submit a contest entry.</p></div><div class='clearfix'></div>"
    },
    {
      "id" : 4,
      "createdOn" : "2016-02-23T00:00:00",
      "image" : "",
      "title" : "Meeting – March 12th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Susan Gee Heino | Serena Gilley</strong><br>DATE:  March. 12, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br>TOPIC: <strong>Cut Out The Middle, Man!</strong><br><br> Having trouble with that sagging middle? Does your synopsis say, \"And then other stuff happens....\"? Do you fall asleep writing chapters four through eleven? Well, say good-bye to the muddling middle!  We'll break down our story without that pesky middle as we take a look at pacing, plotting, character arc, and keeping those pages turning.<br><span id='readmore-marker'></span><br>Bestselling author Susan Gee Heino has a background in theatre as a playwright, actress, and director. Today she writes lighthearted Regency romance, quirky contemporary romance and, under her pen name, Serena Gilley, The Forbidden Realm fantasy romance series. In 2008 she won the RWA Golden Heart® Award for Best Regency Historical, and to date she has 19 titles in publication with traditional New York publishers as well as self-publishing.<br><br>Ms. Heino is a long-time COFW member, national workshop presenter, and preacher's wife who lives in rural Ohio with her heroic husband, two very creative children, and an accidental collection of non-magical critters. She loves to get to know her readers and invites everyone to connect with her on social media or visit her websites at <a href='http://www.SusanGH.com' target='_blank'>www.SusanGH.com</a> and <a href='http://www.SerenaGilley.com' target='_blank'>www.SerenaGilley.com</a>.</p>"
    },
    {
      "id" : 5,
      "createdOn" : "2016-03-18T00:00:00",
      "image" : "",
      "title" : "Meeting – April 16th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Mel Jolly</strong><br>DATE: April. 16, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br>TOPIC: <strong>How to Improve (or Start!) Your Author Newsletter!</strong><br><br> You've probably heard that your author newsletter is your most powerful marketing tool, but how exactly do you go about setting it up? This will be a hands-on, how-to workshop designed to help beginners with the basics, and advanced users with improving their engagement and increasing quality subscribers. Using MailChimp as an example, Mel will cover exactly how to set up your mailing list, design a template, create a custom header using free online software, how to import email addresses, and how to add your newsletter sign up to your website. Mel will also provide takeaway tips for coming up with content and how often to send your newsletter, as well as ideas to increase engagement and tricks for making the whole process pain free. As an added bonus, Mel will show you how to use Canva.com, a free online software, to create your own social media graphics. Want early tips? Sign up for Mel's newsletter at www.AuthorRx.com.<br><strong>Note:</strong> To get the most out of this workshop, bringing your laptop or tablet is recommended. Also, at least one cover image (on your laptop) and buy links.</p>"
    },
    {
      "id" : 6,
      "createdOn" : "2016-04-24T00:00:00",
      "image" : "/app/images/posts/May_2016.jpg",
      "title" : "Next Meeting – May 14th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<small style='font-size: .7em; text-transformation: none'>Photo credits: Joseph Friedman &amp; Joanne Lockyer</small><p>DATE: May. 14, 2016<br>TIME: Business Meeting 12:30 pm, Film screening begins at 1:30 pm, Published Author Networking Event 3:00 - 4:00 pm<br>LOCATION:<br>Norwich Township Safety and Services Building<br>5181 Northwest Parkway<br>Hilliard, OH 43026<br>TOPIC: <strong><em>\"Love Between the Covers\"</em></strong><br><br>Love stories are powerful. And so are the women who write them. Love Between the Covers is a feature-length film chronicling the vast, funny, and savvy female community of romance writing. Emmy award-winning Director/Producer Laurie Kahn followed the lives of five diverse and successful romance authors (and one unpublished newbie) as they built their businesses, found and lost loved ones, coped with a tsunami of change in publishing, and earned a living doing what they love--while empowering others to do the same.</p><span id='readmore-marker'></span><blockquote>\"I think that it shows that women are important. Women's feelings, thoughts, and desires are important.\"</blockquote><p>Pulling back the covers on a billion dollar industry, this film documents romance authors who are on the front lines, pioneering new ways to survive and building communities in our rapidly changing environment.</p><p>Many institutions and individuals have supported this project: the National Endowment for the Humanities, Mass Humanities, the Nora Roberts Foundation, Romance Writers of America, Amazon.com, Harlequin Enterprises, the Tavris Fund at Brandeis University, and donations through the website, lovebetweenthecovers.com.</p><iframe width='560' height='315' src='https://www.youtube.com/embed/uwABHUXofhY' frameborder='0' allowfullscreen></iframe><br>"
    },
    {
      "id" : 7,
      "createdOn" : "2016-05-28T00:00:00",
      "image" : "/app/images/posts/June_2016.jpg",
      "title" : "New Meeting – June 18th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Elizabeth Heiter</strong><br>DATE: June. 18, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br>TOPIC: <strong>Putting Suspense in Your Romantic Suspense</strong><br><br> Romance and suspense – separately, they have their own tensions and rewards. Together, they play off each another to amplify the page-turning effect.  But it can be challenging to blend the two without falling into the traps of having a cookie-cutter and too-obvious mystery or ill-timed and unrealistic love scenes.</p><span id='readmore-marker'></span><p>When romantic suspense is done well, the two elements are so intertwined that you can't pull one out without destroying the flow of the book.  But how do you combine them, still hit your word count, and keep both the suspense and the romance strong, believable and unique?</p><p>Join critically acclaimed and award-winning author ELIZABETH HEITER as she discusses how to put the suspense in your romantic suspense. Elizabeth writes two series: her psychological suspense with romantic elements for MIRA Books, The Profiler series (whose heroine was called “one of the most amazing characters created in print” by Fresh Fiction) and her romantic suspense series for Harlequin Intrigue, The Lawmen series (the latest of which won RT's Reviewers' Choice Award for Best Intrigue). You can learn more about her at <a href='http://www.elizabethheiter.com' target='_blank'>www.elizabethheiter.com</a>.</p>"
    },
    {
      "id" : 8,
      "createdOn" : "2016-06-01T00:00:00",
      "image" : "/app/images/posts/ContestOpen.jpg",
      "title" : "2016 Ignite the Flame Has Begun!",
      "createdBy" : "Rachel",
      "postTags" : [4],
      "type": "Contest",
      "content" : "<p>The annual Ignite the Flame Contest is open for 2016!<br></p><div class='text-center'><a class='btn btn-primary' href='/contest'>Contest Page</a><br><br><p class='text-left'>Click the link above to view the contest page. All forms and documents will appear there, as well as the contest Paypal button. Please be sure to select your correct fee amount and pay through Paypal. <strong>Only online payment will be accepted.</strong> Entries will not be considered until the contest fee is paid in full. Happy Writing and Good Luck!</p></div>"
    },
    {
      "id" : 9,
      "createdOn" : "2016-06-25T00:00:00",
      "image" : "/app/images/posts/July_2016.jpg",
      "title" : "Next Meeting - July 9th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Beth Daniels</strong><br>DATE: July 9th, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br>TOPIC: <strong>Winning Against Procrastination</strong><br><br> Hello, my name is Beth and I'm a Master Procrastinator. Or at least I was. I'm a recovering procrastinator now, but you can't become one of those until you do a few things.</p><p>What are they?</p><ul><li>Realize what is taking up so much of your time</li><li>Clarify whether it really is procrastination or something else</li> <li>Decide to do something about it, deciding what is important and what isn't as important and what doesn't even rate the designation of being considered important</li><li>Weed out impossible dreams from attainable goals</li></ul> <p>A short list? In some ways. But look at it another way. Are you accomplishing anything? Or as much as you want to? If the answer is &quot;ummmm, well,..&quot; it's time to take control. It's not like you want a bushel basket full of &quot;if onlys&quot; rather than an avalanche of true accomplishments, is it? Procrastination is made up of what sometimes feels like a zillion things interfering with any chance of you attaining your dreams. On July 9th, I'll help you start down the path to recovery from chronic procrastination, or even from a mild case of it.</p><span id='readmore-marker'></span><p>Beth Daniels hails from Ohio (the Dayton area) and wears many hats. As Beth Henderson she writes romantic comedy, historical romantic adventure, and romantic suspense. As Beth Cruise she wrote for the old Saved By The Bell series spinning YA romantic comedy. As J.B. Dane she writes mystery and fantasy, and as Nied Darnell she steps into Steampunk. Under her real name she writes non-fiction books about writing fiction or writing college essays. Those books sprung from her years of teaching English Comp at the college level and from the over 60 different workshops she has presented online through various RWA Online Chapters and other online workshop groups. Currently she's at work on a historical romantic mystery, the 2nd book in an urban fantasy series, and polishing the first tome of a Steampunk trilogy. She has a BA in History and an MA in English Composition and Rhetoric with an Emphasis in Creative Writing, and a less official PhD in Procrastination. That last means she's had to REALLY put her mind to besting procrastination...at least when it comes to writing. Visit her at <a href='http://www.RomanceAndMystery2.com' target='_blank'>www.RomanceAndMystery2.com</a>, <a href='http://www.Muse2Ms.com' target='_blank'>www.Muse2Ms.com</a>, or <a href='http://www.WritingSteampunk.com' target='_blank'>www.WritingSteampunk.com</a>.</p>"
    },
    {
      "id" : 10,
      "createdOn" : "2016-07-11T00:00:00",
      "image" : "/app/images/posts/August_2016.jpg",
      "title" : "August 13th Meeting",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p>DATE: August 13th, 2016<br>TIME: Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Norwich Township Safety and Services Building<br>5181 Northwest Parkway<br>Hilliard, OH 43026<br>TOPIC: <strong>RWA National Conference Recap</strong><br><br> Chapter members that attended RWA National will share information from workshops.</p>"
    },
    {
      "id" : 11,
      "createdOn" : "2016-08-06T00:00:00",
      "image" : "/app/images/posts/Contest_Winners.jpg",
      "title" : "Contest Winners Announced!",
      "createdBy" : "Rachel",
      "postTags" : [4],
      "type": "Contest",
      "content" : "<p class='text-center'>Contest Winners have been announced!</p><div class='text-center'><h3 class='text-center'>Congratulations to the winners!</h3><a class='btn btn-primary' href='/contest'>Contest Page</a></div>"
    },
    {
      "id" : 12,
      "createdOn" : "2016-08-15T00:00:00",
      "image" : "/app/images/posts/September_2016.jpg",
      "title" : "Next Meeting - September 17th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Alicia Rasley</strong><br>DATE: September 17th, 2016<br>TIME: Business meeting at 12:00 pm, Speaker at 1 - 2:30pm, Break & Refreshments 2:30 - 3pm, Speaker continues 3 - 4:30pm<br>LOCATION:<br>Norwich Township Safety and Services Building<br>5181 Northwest Parkway<br>Hilliard, OH 43026<br>TOPIC: <strong>Being, Doing, Becoming – The Heroic Flaw and The Heroic Journey</strong><br><br>Nature abhors perfection– and so does the story.<br>Fiction, like nature, is all about change. So in a story, heroism requires more than being perfectly heroic, and even more than committing heroic acts. It also requires the ability to change under pressure, to grow into someone better even if it hurts.</p><p>In the same way, creating a heroic character requires more of the author than merely creating a perfectly brave protagonist and inventing exciting events to showcase those powers and skills. It requires providing the protagonist the need to change, the courage to change, the opportunity to change, and the motivation to change. The imperfect protagonist makes the three-dimensional story possible. The character moving through the external plot is a story of only two dimensions. The internal journey, the process towards psychological or emotional or life change, provides the depth that takes this story into three dimensions.</p><span id='readmore-marker'></span><p>In this interactive workshop, we'll explore how you can determine your own character's heroic flaw, and use it to develop a meaningful opening, a powerful journey, and a dramatic and satisfying ending.</p><p>Emotion Without Purple Prose<br>In this interactive workshop, bestselling author Alicia Rasley helps you explore two “non-purple-prose” ways of creating a compelling emotional experience for readers: Story Design and Scene Design. Interactive exercises focus on your story as you move beyond plotting into presentation, as Alicia provides helpful feedback aimed at helping you find and create the emotion. You'll leave with some seriously useful (but easily applied) strategies to deepen your story and scenes, and you'll have a chance to ask Alicia for advice on your own work. In this friendly and conversational workshop, you'll learn:<ul><li>Shaping the entire plot to create emotion in the reader</li><li>Arranging story events to tighten, focus and maximize drama</li><li>Going beyond just describing emotion to actually induce emotion</li><li>Using scene design, body language, and “magic rule of three”</li><li>Creating emotion without purple language or overwriting</li></ul><br><p>Alicia Rasley lives in Regency England-- well, no. She just writes about it! She lives in the American midwest, surrounded by books about Regency England. Her Regency romances have won several awards, including the prestigious RITA for Best Regency Romance. She has also written women's fiction, mystery, and non-fiction books. She teaches writing online and at a state university, hoping to instill the love of commas into today's college students.</p>"
    },
    {
      "id" : 13,
      "createdOn" : "2016-09-18T00:00:00",
      "image" : "/app/images/posts/October_2016.jpg",
      "title" : "Upcoming Meeting on October 15th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p>DATE: October 15th, 2016<br>TIME: Business meeting at 10:00 am, Conference begins at 10:30 am<br>LOCATION:<br>Upper Arlington, Main Library<br>2800 Tremont Rd<br>Columbus, OH 43221<br>TOPIC: <strong>\"The Write Stuff\" Writer's Conference</strong><br><br>Free sessions by several local authors to be held throughout the day, as well as an expo of local publishers and organizations in the atrium from 10:30 am - 4:00 pm. For more information and to register for sessions, please visit the <a class='btn btn-primary' href='https://www.ualibrary.org/calendar-field-event-date/day/2016-10-15' target='_blank' alt='Events Calendar UA Library'>UA Library Event Calendar</a></p>"
    },
    {
      "id" : 14,
      "createdOn" : "2016-10-15T00:00:00",
      "image" : "/app/images/posts/November_2016.png",
      "title" : "Next Meeting - November 19th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Tracy Brogan</strong><br>DATE: November 19th, 2016<br>TIME: Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Norwich Township Safety and Services Building<br>5181 Northwest Parkway<br>Hilliard, OH 43026<br>TOPIC: <strong>Creating a Big Story from Small Moments</strong><br><br>Entertaining fiction is often filled with larger-than-life characters facing extraordinary situations. Ticking time-bombs, impending tsunamis, a cocked and loaded pistol, a grizzly dead body – or any combination thereof - are all reliable plot devices used to engage readers and keep a story exciting. But what if your heroine is just a regular person dealing with an average life? Is that a snooze-fest? Or is there a story there? I say there is! Learn to create fresh, relatable, and riveting tales by infusing small moments with tension, suspense, humor, and romance without resorting to kidnapping plots and catastrophes. It's all about timing, establishing for the reader how the character feels, and how each incremental event keeps those pages turning and builds up to a big, satisfying ending.</p><span id='readmore-marker'></span><p>Past or present, Tracy Brogan loves romance. She's a bestselling author of both contemporary romantic comedies and historical romance. Her books have hit the Amazon Bestsellers list, as well as the Wall Street Journal Bestsellers list. She has received numerous writing awards, including the coveted Diamond Award from Amazon Publishing.</p><p>Her debut novel, <a href='http://www.tracybrogan.com/crazy-little-thing/' target='_blank'><strong>CRAZY LITTLE THING</strong></a>, was nominated for a prestigious RITA award by Romance Writers of America® for Best First Book in 2013. It ranked #15 on the Wall Street Journal, and landed at #33 on the Kindle Bestsellers list for 2013. Two more Bell Harbor books have gone on to become bestsellers and RITA nominees as well. <a href='http://www.tracybrogan.com/the-best-medicine/' target='_blank'><strong>THE BEST MEDICINE (2015)</strong></a> and <a href='http://www.tracybrogan.com/love-me-sweet/' target='_blank'><strong>LOVE ME SWEET (2016)</strong></a>. Brogan's books have been translated into several languages, including French, German, Spanish, Turkish, Hungarian, Japanese, Dutch, and Hebrew. Brogan's first historical romance, her bestselling, <a href='http://www.tracybrogan.com/highland-surrender/' target='_blank'><strong>HIGHLAND SURRENDER</strong></a>, won a Golden Quill and the Book Sellers Best award in 2013. <a href='http://www.tracybrogan.com/hold-on-my-heart/' target='_blank'><strong>HOLD ON MY HEART</strong></a> released in 2013.</p><p>Brogan lives in Michigan, the state shaped like a mitten, and is therefore prone to pointing to the palm of her hand when explaining where she's from. She loves to hear from readers so please email her at <a href='mailto:tracybrogan@att.net' target='_blank'><strong>tracybrogan@att.net</strong></a>, check out her website, <a href='http://www.tracybrogan.com' target='_blank'><strong>www.tracybrogan.com</strong></a> or visit her on <a href='https://www.facebook.com/AuthorTracyBrogan?ref=hl' target='_blank'><strong><i class='fa fa-facebook'></i></strong></a> or <a href='http://www.twitter.com/tracybrogan' target='_blank'><strong><i class='fa fa-twitter'></i></strong></a></p>"
    },
    {
      "id" : 15,
      "createdOn" : "2016-11-23T20:00:00",
      "image" : "/app/images/posts/holidayPost.jpg",
      "title" : "Happy Holidays from COFW!",
      "createdBy" : "Rachel",
      "postTags" : [5],
      "type": "",
      "content" : ""
    },
    {
      "id" : 16,
      "createdOn" : "2016-12-20T00:00:00",
      "image" : "/app/images/posts/January_2017.png",
      "title" : "First Meeting of 2017!",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p>DATE &amp; TIME &nbsp; | &nbsp; January 14th, 2017 - Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION &nbsp; | &nbsp; <a href='http://maps.google.com/?q=5181 Northwest Parkway, Hilliard, OH 43026' target='_blank'>Norwich Twp Safety &amp; Services Building 5181 Northwest Parkway, Hilliard, OH 43026 <i class='fa fa-map-marker'></i></a><br>TOPIC &nbsp; | &nbsp; <strong>COFW Author Panel Discussion: Market Day</strong><br><br>Join us for this multiple-author panel comprised of an array of writers from COFW's list of distinguished novelists. The discussion will concentrate on the current market in publishing these days, as seen through the eyes of our panelists. These talented authors were chosen as a microcosm of the vast spectrum within the publishing industry, ranging from traditionally published NYT best-sellers to small press authors and self-published works, as well as hybrid authors who do it all.  Each writer will offer a summary of their personal experiences with the industry and give their take on today's market, before answering your questions during a Q&amp;A session. Our panelists are: <br><br><strong>Karen Harper</strong>, NYT and USA Today Best-selling author of historical fiction and contemporary romance. Karen has been traditionally published with Harlequin and other publishers for over 30 years. (<a href='http://karenharperauthor.com' target='_blank'>karenharperauthor.com</a>)<br><strong>Becky Barker</strong>, award winning author of contemporary romance and romantic suspense who has published works with multiple publishers (Harlequin, Kensington, Samhain, Dell and more) as well as Indie publishing her own work. (<a href='http://beckybarker.com' target='_blank'>beckybarker.com</a>)<br><strong>Donna MacMeans</strong>, award winning author of historical romances, as well as suspense. Donna is traditionally published with Berkley, e-pubbed with Samhain and has self-published too. (<a href='http://www.donnamacmeans.com' target='_blank'>donnamacmeans.com</a>)<br><strong>Robin Gianna</strong>, author of category romances for Harlequin's Medical line. (<a href='http://www.robingianna.com' target='_blank'>robingianna.com</a>)<br><strong>Susan Gee Heino</strong>, award winning author of witty historical romances, both traditionally published with Berkley Publishing and Indie-Published too. <a href='http://susangh.com' target='_blank'>(susangh.com</a>)<br><strong>Karin Shah</strong>, author of paranormal romances for e-publishers, Samhain and Soul Mate Publishing. (<a href='http://facebook.com/KarinShahAuthor' target='_blank'>facebook.com/KarinShahAuthor</a>)</p>"
    },
    {
      "id" : 17,
      "createdOn" : "2016-12-20T00:00:00",
      "releaseOn" : "2017-01-14T23:59:00",
      "image" : "/app/images/posts/February_2017.png",
      "title" : "February Meeting",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p>DATE &amp; TIME &nbsp; | &nbsp; February 18th, 2017 - Business Meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION &nbsp; | &nbsp; <a href='http://maps.google.com/?q=5181 Northwest Parkway, Hilliard, OH 43026' target='_blank'>Norwich Twp Safety &amp; Services Building 5181 Northwest Parkway, Hilliard, OH 43026 <i class='fa fa-map-marker'></i></a><br>TOPIC &nbsp; | &nbsp; <strong>Simplify and Thrive – Declutter your Career</strong><br><h5 style='letter-spacing: .2em; font-weight: 700'>HOUR ONE | YOUR CORE STORY AND YOUR BRAND</h5><p>Zeroing in on your core story provides clarity in your writing, branding, and overall satisfaction as an author. Who doesn't want to take away some of the stress and clutter and enjoy their job a little more? In this hour-long workshop, Donna Alward explains why simplifying is so helpful, how to find your core story, and how this helps with brand-building.</p><h5 style='letter-spacing: .2em; font-weight: 700'>HOUR TWO | PASSIVE AGGRESSIVE MARKETING</h5><p>Facebook parties. Bookbub Ads. Live Chats. Blog Tours. The list of \"must dos\" goes on and on – and how can an author possibly do it all and still maintain a rigorous publishing schedule (and avoid burnout)? If you have a love/hate relationship with marketing, join author Donna Alward for this one-hour workshop as she helps you get off the promotion merry-go-round, and develop simple strategies so that your marketing plan keeps working for you while you're sleeping - or busy writing your next bestseller.</p><p>Donna's Awards and Recognition</p><ul style='margin-top: -15px'><li>2012 Colorado Award of Excellence: How A Cowboy Stole Her Heart</li><li>2012 RITA Award Finalist: How a Cowboy Stole Her Heart</li><li>2011 Cataromance Reviewer's Choice Award: How A Cowboy Stole Her Heart</li><li>2011 Bookseller's Best Award: Her Lone Cowboy</li><li>2011 Colorado Award of Excellence: Her Lone Cowboy</li><li>2011 Dunes and Dreams Cover Contest: Sold to the Highest Bidder</li><li>2008 Cataromance Reviewer's Choice Award:  Falling for Mr. Dark and Dangerous</li><li>2008 Bookseller's Best Award:  Hired By The Cowboy</li><li>2007 Cataromance Reviewer's Choice Award:  Marriage at Circle M</li></ul><p>Donna lives on Canada's east coast with her family which includes a husband, a couple of kids, a senior dog and two crazy cats. When she's not writing she enjoys reading (of course!), knitting, gardening, cooking...and is a Masterpiece Theater addict. You can visit her on the web at <a href='http://www.DonnaAlward.com' target='_blank'>www.DonnaAlward.com</a></p>"
    }
  ],
  "tags": [
    {
      "title": "Meeting",
      "type": "info",
      "id": 1
    },{
      "title": "Speaker",
      "type": "warning",
      "id" : 2
    },{
      "title": "Newsletter",
      "type": "success",
      "id" : 3
    },{
      "title": "Contest",
      "type": "default",
      "id" : 4
    },{
      "title": "Misc",
      "type": "default",
      "id" : 5
    }
  ]
}