{
  "posts": [
    {
      "id": 1,
      "createdOn" : "2015-12-29T00:00:00",
      "image" : "/app/images/posts/January_16.jpg",
      "title" : "January Meeting - New Location!",
      "postTags" : [1, 2],
      "createdBy" : "Rachel",
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Donna MacMeans</strong><br>Donna is a multi-published author and Certified Public Accountant.<br>DATE:  Jan. 16, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION: We will be meeting at this new location for the first several months of 2016<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br><br>TOPIC: With the holidays behind us, it’s time to turn our attention to taxes. Let Donna answer your pressing tax questions as it relates to writing – you’re sure to learn things you didn’t know!<ul><li>Is your writing a business or a hobby?  Nine questions you need to answer to know if your writing is a business.</li><li>How to maximize your deductions to reduce income</li><li>As an indie or traditional author, what forms must YOU send to the IRS to report certain transactions?</li><li>Now that you’ve published, what forms can you expect to receive to assist you in preparing your return?</li><li>Self-employment tax, do you owe it? How is it calculated?</li><li>Suggestions on making your bookkeeping easier for 2016.</li></ul></p>"
    },
    {
      "id" : 2,
      "createdOn" : "2015-12-29T00:00:00",
      "image" : "/app/images/posts/February_16.jpg",
      "title" : "February Meeting",
      "createdBy" : "Rachel",
      "postTags" : [1, 2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Gigi Morgan</strong><br>DATE:  Feb. 13, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br><br>TOPIC: <strong>Introduction to Scrivener 2</strong><br><br> Meet the one piece of software that will change how you write forever. Plotter, pantser, and everyone in-between can benefit from the innovative features of Literature and Latte’s Scrivener 2. From keeping you more organized, never letting you lose another draft, or creating an e-book, Scrivener is the toolbox every writer needs. Get your feet wet before the presentation by downloading the free trial version today. Available for both Apple and Windows computers, the free trial version contains full functionality and 30 days of use.</p>"
    },
    {
      "id" : 3,
      "createdOn" : "2016-02-10T00:00:00",
      "image" : "/app/images/posts/igniteFlame_Feb.jpg",
      "title" : "Contest Coming Soon!",
      "createdBy" : "Rachel",
      "postTags" : [4],
      "type": "Contest",
      "content" : "<p>The annual Ignite the Flame Contest is gearing up for 2016! Judges have been assigned and categories have been announced!<br></p><div class='col-md-6 col-sm-12 text-center'><a class='btn btn-primary' href='/contest'>Contest Page</a><br><br><p class='text-left'>Click the link above to view the contest page. Any updates and forms will appear here. Check back for updates, as we will make any contest related announcements here.</p></div><div class='col-md-6 col-sm-12 text-center'><a class='btn btn-primary' href='http://cofwevents.org/docs/ITF_Contest_Rules_2016.pdf' target='_blank'> Contest Rules </a><br><br><p class='text-left'>You can also check out the rules and scoring information by visiting the above link. We've provided a printable pdf of information you will need to submit a contest entry.</p></div><div class='clearfix'></div>"
    },
    {
      "id" : 4,
      "createdOn" : "2016-02-23T00:00:00",
      "image" : "/app/images/posts/March_2016.jpg",
      "title" : "Meeting - March 12th",
      "createdBy" : "Rachel",
      "postTags" : [1,2],
      "type": "Meeting",
      "content" : "<p><strong>Speaker – Susan Gee Heino | Serena Gilley</strong><br>DATE:  March. 12, 2016<br>TIME:  Business meeting at 12:30 pm, Speaker at 1:30 pm<br>LOCATION:<br>Fire Station 83<br>4283 Davidson Road<br>Hilliard, OH 43026<br><br>TOPIC: <strong>Cut Out The Middle, Man!</strong><br><br> Having trouble with that sagging middle? Does your synopsis say, \"And then other stuff happens....\"? Do you fall asleep writing chapters four through eleven? Well, say good-bye to the muddling middle!  We'll break down our story without that pesky middle as we take a look at pacing, plotting, character arc, and keeping those pages turning.<br><br>Bestselling author Susan Gee Heino has a background in theatre as a playwright, actress, and director. Today she writes lighthearted Regency romance, quirky contemporary romance and, under her pen name, Serena Gilley, The Forbidden Realm fantasy romance series. In 2008 she won the RWA Golden Heart® Award for Best Regency Historical, and to date she has 19 titles in publication with traditional New York publishers as well as self-publishing.<br><br>Ms. Heino is a long-time COFW member, national workshop presenter, and preacher's wife who lives in rural Ohio with her heroic husband, two very creative children, and an accidental collection of non-magical critters. She loves to get to know her readers and invites everyone to connect with her on social media or visit her websites at <a href='http://www.SusanGH.com' target='_blank'>www.SusanGH.com</a> and <a href='http://www.SerenaGilley.com' target='_blank'>www.SerenaGilley.com</a>.</p>"
    }
  ],
  "tags": [
    {
      "title": "Meeting",
      "type": "info",
      "id": 1
    },{
      "title": "Speaker",
      "type": "warning",
      "id" : 2
    },{
      "title": "Newsletter",
      "type": "success",
      "id" : 3
    },{
      "title": "Contest",
      "type": "default",
      "id" : 4
    }
  ]
}